export type PriceItem = {
	name: string;
	price: string;
};

export type PriceCategory = {
	id: string;
	label: string;
	prices: PriceItem[];
};

export const priceCategorie: PriceCategory[] = [
	{
		id: "kuzov",
		label: "Кузов",
		prices: [
			{
				name: "Полірування кузова авто",
				price: "8 000 - 11 000 грн",
			},
			{
				name: "Чистка кузова від бітуму та інших забруднень",
				price: "1 200 грн",
			},
			{
				name: "Нанесення твердого воску з ощищенням кузову",
				price: "2 000 грн",
			},
			{
				name: "Оклейка антигравійною плівкою фронтальної частини авто",
				price: "40 000+ грн",
			},
			{
				name: "Мийка авто 3 фази (ручна) з вологим прибиранням",
				price: "1 200 грн",
			},
			{ name: "Мийка підкапотного простору", price: "1 000 грн" },
			{ name: "Нанесення покриття антидощ ", price: "2 500 грн" },
			{ name: "Антихром", price: "Договірна" },
			{
				name: "Полірування оптики з її оклейкою",
				price: "3 000 - 3 500 грн",
			},
			{ name: "Нанесення керамічного покриття (кузов)", price: "9 000 грн" },
		],
	},
	{
		id: "salon",
		label: "Салон",
		prices: [
			{
				name: "Хімчистка салона авто",
				price: `Малий 5 000 грн | Середній 5 500 грн | Бізнес 5 800 грн | Позашляховик 6 000 грн`,
			},
			{ name: "Хімчистка сидінь", price: "2 500 грн" },
			{ name: "Реставрація шкіряного салону", price: "Договірна" },
			{
				name: "Тонування",
				price: "від 4000 грн",
			},
			{
				name: "Нанесення керамічного покриття шкіряний салон",
				price: "5 000 - 6 000 грн",
			},
			{ name: "Озонація", price: "600 грн" },
		],
	},
];
