export type ServiceItem = {
	name: string;
	price: string;
};

export type ServiceCategory = {
	id: string;
	label: string;
	services: ServiceItem[];
};

export const serviceCategorie: ServiceCategory[] = [
	{
		id: "kuzov",
		label: "Кузов",
		services: [
			{
				name: "Мийка авто 3 фази (ручна) з вологим прибиранням",
				price: "1 000 грн",
			},
			{ name: "Мийка підкапотного простору", price: "800 грн" },
			{
				name: "Чистка кузова від бітуму та інших забруднень",
				price: "1 200 грн",
			},
			{
				name: "Нанесення твердого воску з ощищенням кузову",
				price: "1 500 грн",
			},
			{ name: "Нанесення керамічного покриття (кузов)", price: "9 000 грн" },
			{ name: "Нанесення покриття антидощ", price: "1 500 грн" },
			{ name: "Полірування кузова авто", price: "7 000 - 11 000 грн" },
			{ name: "Полірування оптики з її оклейкою", price: "3 000 - 3 500 грн" },
			{
				name: "Оклейка антигравійною плівкою фронтальної частини авто",
				price: "40 000 - 50 000 грн",
			},
			{ name: "Антихром", price: "Договірна" },
		],
	},
	{
		id: "salon",
		label: "Салон",
		services: [
			{
				name: "Хімчистка салона авто",
				price:
					"Малий 4 000 грн | Середній 4 300 грн | Бізнес 4 700 грн | Позашляховик 5 000 грн",
			},
			{ name: "Хімчистка сидінь", price: "2 000 грн" },
			{ name: "Озонація", price: "500 грн" },
			{
				name: "Нанесення керамічного покриття шкіряний салон",
				price: "5 000 - 6 000 грн",
			},
			{ name: "Реставрація шкіряного салону", price: "Договірна" },
			{ name: "Реставраційні роботи", price: "Договірна" },
			{ name: "Тонування", price: "4 000 - 8 000 грн" },
		],
	},
];
