export type ServiceItem = {
	name: string;
	slug: string;
	text: string;
	price?: string;
	image: string;

	optionPrice?: {
		name: string;
		price: string;
	}[];
};

export type ServiceCategory = {
	id: string;
	label: string;
	services: ServiceItem[];
};

export const serviceCategorie: ServiceCategory[] = [
	{
		id: "kuzov",
		label: "Кузов",
		services: [
			{
				image: "/images/serv-3.jpg",
				name: "Полірування кузова авто",
				text: "Ми використовуємо тільки професійні матеріали й сучасне обладнання, а також підбираємо тип полірування індивідуально для кожного авто: корекційне, відновлююче, глибоке,тощо. Подаруйте своєму авто нове життя – запишіться на полірування вже сьогодні!",
				price: "8 000 - 11 000 грн",
				slug: "poliruvannya-kuzova-avto",
			},
			{
				image: "/images/serv-19.jpg",

				name: "Чистка кузова від бітуму та інших забруднень",
				text: "Чистка кузова від бітуму та інших забруднень — це процедура, яка видаляє важкі забруднення, що шкодять лакофарбовому покриттю. Використовуються спеціальні засоби та щітки для ефективного і безпечного очищення, що допомагає підтримувати авто в ідеальному стані.",
				price: "1 200 грн",
				slug: "chistka-kuzova-bitum",
			},
			{
				image: "/images/serv-20.jpg",

				name: "Нанесення твердого воску з ощищенням кузову",
				text: "Нанесення твердого воску з очищенням кузова — це процедура, що включає спочатку видалення забруднень з поверхні авто, а потім нанесення захисного твердого воску. Воск створює надійний шар, який захищає лакофарбове покриття від зовнішніх впливів, надає блиск і полегшує подальше очищення. Це допомагає зберегти автомобіль у відмінному стані та продовжити термін служби покриття.",
				price: "2 000 грн",
				slug: "nanesennya-vosku",
			},
			{
				image: "/images/serv-9.jpg",
				name: "Оклейка антигравійною плівкою фронтальної частини авто",
				text: `Антигравійна плівка захистить кузов вашого авто від подряпин,сколів, ультрафіолетового випромінювання, та хімічних речовин.
Плівка майже не помітна на кузові і збереже ваше авто в ідеальному стані на роки.
Ми працюємо з преміальними матеріалами та гарантуємо високу якість монтажу.
Захист починається з першого кілометра – замовляй антигравійне оклеювання вже зараз!`,
				price: "40 000+ грн",
				slug: "okleyka-antigraviynoyu-plivkoyu",
			},
			{
				image: "/images/serv-4.jpg",

				name: "Мийка авто 3 фази (ручна) з вологим прибиранням",
				text: `Детейлінг мийка – ідеальна чистота в кожній деталі!
Комплексне очищення кузова, коліс, арок, з делікатним підходом до кожного елементу.
Піна, ручна мийка, сушка без розводів – жодної подряпини!
Авто виглядає як нове – чистота, блиск і турбота на рівні преміум.`,
				price: "1 200 грн",
				slug: "miyka-avto-3-fazy",
			},
			{
				image: "/images/serv-7.jpg",

				name: "Мийка підкапотного простору",
				text: `Акуратно очищаємо підкапотний простір від бруду, пилу та слідів технічних рідин. Безпечна технологія без ризику для електроніки та контактів.
Охайний двигун – це приємно, безпечно і практично.`,
				price: "1 000 грн",
				slug: "miyka-pidkapotnogo-prostoru",
			},
			{
				image: "/images/serv-8.jpg",

				name: "Нанесення покриття антидощ",
				text: `Антидощ — це спеціальне водовідштовхувальне покриття для скла автомобіля або інших поверхонь. Воно створює захисний шар, що зменшує прилипання води, забезпечуючи кращу видимість під час дощу. Краплі води швидко стікають або здуваються вітром, що покращує безпеку та комфорт водіння.`,
				price: "2 500 грн",
				slug: "antidozhd",
			},
			{
				image: "/images/serv-16.jpg",

				name: "Антихром",
				text: `Антихром за допомогою плівки — це спосіб затемнення елементів автомобіля шляхом обклеювання їх спеціальною вініловою плівкою. Такий метод є зворотнім (плівку можна зняти без пошкодження оригінального покриття), захищає деталі від подряпин і корозії та надає авто стильний вигляд. Доступні різні варіанти плівок: матові, глянцеві, сатинові або текстуровані.`,
				price: "Договірна",
				slug: "antihrom",
			},
			{
				image: "/images/serv-15.jpg",

				name: "Полірування оптики з її оклейкою",
				text: `Відновлення оптики — це процес покращення прозорості та зовнішнього вигляду фар автомобіля. Ми виконуємо механічне полірування, яке усуває подряпини, помутніння та жовтизну, а потім захищаємо фари спеціальною захисною плівкою. Це не лише відновлює оптику, а й продовжує її термін служби, захищаючи від подальших пошкоджень, подряпин та вигоряння.`,
				price: "3 000 - 3 500 грн",
				slug: "poliruvannya-optyky",
			},
			{
				image: "/images/serv-18.jpg",

				name: "Нанесення керамічного покриття (кузов)",
				text: `Створює тверде, водовідштовхувальне покриття, яке захищає лак від подряпин, хімії, слідів пташиного посліду,УФ-променів і бруду.
Авто довше виглядає як нове, а миття займає менше часу.
До 3 років ефекту – глибокий колір, дзеркальний блиск і реальний захист.`,
				price: "9 000 грн",
				slug: "keramichne-pokryttya-kuzov",
			},
		],
	},
	{
		id: "salon",
		label: "Салон",
		services: [
			{
				image: "/images/serv-14.jpg",

				name: "Хімчистка салона авто",
				text: `Професійна хімчистка салону авто.
Оновимо ваш салон до ідеального стану! Видалимо пил, плями, запахи, шерсть та мікроби. Чистимо сидіння, стелю, килимки, багажник і всі важкодоступні місця. Працюємо з тканиною, шкірою, алькантарою.
Результат – чистота, свіжість і комфорт як у новому авто.
Безпечні засоби, увага до деталей. Записуйтеся вже сьогодні!`,
				slug: "himchistka-salona",
				optionPrice: [
					{
						name: "Малий автомобіль",
						price: "5000 грн",
					},
					{
						name: "Середній автомобіль",
						price: "5500 грн",
					},
					{
						name: "Великий автомобіль",
						price: "5800 грн",
					},
					{
						name: "Позашляховик",
						price: "6000 грн",
					},
				],
			},
			{
				image: "/images/serv-21.jpg",

				name: "Хімчистка сидінь",
				text: `Хімчистка сидінь — це процес глибокого очищення оббивки автомобільних сидінь за допомогою спеціалізованих миючих засобів та обладнання. Під час хімчистки видаляються забруднення, плями, пил та неприємні запахи, що накопичилися в тканині або шкірі. Ця процедура не лише покращує зовнішній вигляд інтер'єру, а й сприяє створенню здорової атмосфери в автомобілі, підвищуючи комфорт під час поїздок.`,
				price: "2 500 грн",
				slug: "himchistka-sydin",
			},
			{
				image: "/images/serv-22.jpg",

				name: "Реставрація шкіряного салону",
				text: `Реставрація шкіряного салону — це процес відновлення і підтримки шкіряної оббивки автомобільних сидінь та інших елементів інтер'єру. Він включає в себе очищення, усунення потертостей, тріщин і дефектів, а також нанесення засобів для догляду, що відновлюють природний відтінок і еластичність шкіри. Реставрація допомагає повернути шкіряним елементам первісний вигляд, забезпечуючи не лише естетичний аспект, а й продовжуючи термін служби матеріалу. Це ідеальне рішення для тих, хто хоче зберегти свій автомобіль в сучасному і привабливому стані.`,
				price: "Договірна",
				slug: "restavraciya-shkiry",
			},
			{
				image: "/images/serv-12.jpg",

				name: "Тонування",
				text: `Тонування — це процес обклеювання скла автомобіля спеціальною тонувальною плівкою для покращення комфорту та безпеки. Воно зменшує нагрів салону, захищає від ультрафіолетових променів, підвищує конфіденційність і надає авто стильний вигляд. Доступні різні ступені затемнення, а також варіанти плівок: класичні, атермальні та керамічні.`,
				price: "від 4 000 грн",
				slug: "tonuvannya",
			},
			{
				image: "/images/serv-11.jpg",

				name: "Нанесення керамічного покриття шкіряний салон",
				text: `Керамічне покриття шкіряних елементів — це захисне покриття, яке створює на поверхні шкіри невидимий бар’єр, що відштовхує вологу, бруд і масла. Воно запобігає передчасному зносу, появі плям і розтріскуванню, зберігаючи природну м’якість і текстуру матеріалу. Покриття полегшує догляд за салоном і продовжує термін служби шкіряних елементів.`,
				price: "5 000 - 6 000 грн",
				slug: "keramika-shkiry",
			},
			{
				image: "/images/serv-10.jpg",

				name: "Озонація",
				text: `Позбавимо авто від неприємних запахів (тютюн, волога, їжа), бактерій, алергенів і грибка.
Процедура абсолютно безпечна, не маскує запахи – а знищує їх на молекулярному рівні.
Результат – свіже, стерильне повітря та комфорт для кожної поїздки.`,
				price: "600 грн",
				slug: "ozonaciya",
			},
		],
	},
];
